#### Terraform Plan 📖 success
```
google_compute_global_address.main: Refreshing state... [id=projects/explore-293719/global/addresses/main]
google_storage_bucket.dash: Refreshing state... [id=spacemesh-dash]
google_storage_bucket.explorer: Refreshing state... [id=spacemesh-explorer]
statuspage_component.explorer[0]: Refreshing state... [id=pyc8cpxyz11g]
statuspage_component.api[0]: Refreshing state... [id=pwm68pwcsvb1]
statuspage_component.dash[0]: Refreshing state... [id=6jcs8sm4kxw2]
google_storage_default_object_access_control.explorer: Refreshing state... [id=spacemesh-explorer/allUsers]
google_compute_backend_bucket.explorer: Refreshing state... [id=projects/explore-293719/global/backendBuckets/spacemesh-explorer]
google_compute_backend_bucket.dash: Refreshing state... [id=projects/explore-293719/global/backendBuckets/spacemesh-dash]
google_storage_default_object_access_control.dash: Refreshing state... [id=spacemesh-dash/allUsers]
google_compute_url_map.main: Refreshing state... [id=projects/explore-293719/global/urlMaps/main]
google_compute_target_http_proxy.main: Refreshing state... [id=projects/explore-293719/global/targetHttpProxies/main]
google_compute_global_forwarding_rule.main: Refreshing state... [id=projects/explore-293719/global/forwardingRules/main]
pagerduty_user.aviv: Refreshing state... [id=P61JOXI]
pagerduty_escalation_policy.main: Refreshing state... [id=P0A7W6U]
pagerduty_service.dash[0]: Refreshing state... [id=PF4B9YT]
pagerduty_service.explorer[0]: Refreshing state... [id=PBVQ8J3]
pagerduty_service.api[0]: Refreshing state... [id=PIDMNNG]
pagerduty_service_integration.dash[0]: Refreshing state... [id=P2UW4QU]
pagerduty_service_integration.explorer[0]: Refreshing state... [id=PLQF4AB]
pagerduty_service_integration.api[0]: Refreshing state... [id=P63H52H]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_compute_url_map.main will be updated in-place
  ~ resource "google_compute_url_map" "main" {
        id                 = "projects/explore-293719/global/urlMaps/main"
        name               = "main"
        # (6 unchanged attributes hidden)

      + host_rule {
          + hosts        = [
              + "dash-20.spacemesh.io",
              + "dash-21.spacemesh.io",
            ]
          + path_matcher = "dash"
        }
      - host_rule {
          - hosts        = [
              - "dash-20.spacemesh.io",
            ] -> null
          - path_matcher = "dash" -> null
        }
      + host_rule {
          + hosts        = [
              + "explorer-20.spacemesh.io",
              + "explorer-21.spacemesh.io",
            ]
          + path_matcher = "explorer"
        }
      - host_rule {
          - hosts        = [
              - "explorer-20.spacemesh.io",
            ] -> null
          - path_matcher = "explorer" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service.api[1] will be created
  + resource "pagerduty_service" "api" {
      + acknowledgement_timeout = "null"
      + alert_creation          = "create_alerts_and_incidents"
      + auto_resolve_timeout    = "null"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = "P0A7W6U"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "api-21"
      + status                  = (known after apply)

      + incident_urgency_rule {
          + type    = (known after apply)
          + urgency = (known after apply)

          + during_support_hours {
              + type    = (known after apply)
              + urgency = (known after apply)
            }

          + outside_support_hours {
              + type    = (known after apply)
              + urgency = (known after apply)
            }
        }
    }

  # pagerduty_service.dash[1] will be created
  + resource "pagerduty_service" "dash" {
      + acknowledgement_timeout = "null"
      + alert_creation          = "create_alerts_and_incidents"
      + auto_resolve_timeout    = "null"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = "P0A7W6U"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "dash-21"
      + status                  = (known after apply)

      + incident_urgency_rule {
          + type    = (known after apply)
          + urgency = (known after apply)

          + during_support_hours {
              + type    = (known after apply)
              + urgency = (known after apply)
            }

          + outside_support_hours {
              + type    = (known after apply)
              + urgency = (known after apply)
            }
        }
    }

  # pagerduty_service.explorer[1] will be created
  + resource "pagerduty_service" "explorer" {
      + acknowledgement_timeout = "null"
      + alert_creation          = "create_alerts_and_incidents"
      + auto_resolve_timeout    = "null"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = "P0A7W6U"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "explorer-21"
      + status                  = (known after apply)

      + incident_urgency_rule {
          + type    = (known after apply)
          + urgency = (known after apply)

          + during_support_hours {
              + type    = (known after apply)
              + urgency = (known after apply)
            }

          + outside_support_hours {
              + type    = (known after apply)
              + urgency = (known after apply)
            }
        }
    }

  # pagerduty_service_integration.api[1] will be created
  + resource "pagerduty_service_integration" "api" {
      + html_url          = (known after apply)
      + id                = (known after apply)
      + integration_email = (known after apply)
      + integration_key   = (known after apply)
      + name              = "api-21"
      + service           = (known after apply)
      + type              = "events_api_v2_inbound_integration"
      + vendor            = (known after apply)
    }

  # pagerduty_service_integration.dash[1] will be created
  + resource "pagerduty_service_integration" "dash" {
      + html_url          = (known after apply)
      + id                = (known after apply)
      + integration_email = (known after apply)
      + integration_key   = (known after apply)
      + name              = "dash-21"
      + service           = (known after apply)
      + type              = "events_api_v2_inbound_integration"
      + vendor            = (known after apply)
    }

  # pagerduty_service_integration.explorer[1] will be created
  + resource "pagerduty_service_integration" "explorer" {
      + html_url          = (known after apply)
      + id                = (known after apply)
      + integration_email = (known after apply)
      + integration_key   = (known after apply)
      + name              = "explorer-21"
      + service           = (known after apply)
      + type              = "events_api_v2_inbound_integration"
      + vendor            = (known after apply)
    }

  # statuspage_component.api[1] will be created
  + resource "statuspage_component" "api" {
      + automation_email = (known after apply)
      + id               = (known after apply)
      + name             = "Spacemesh devnet 21 Public API"
      + page_id          = "twrbgq249mgx"
      + showcase         = true
      + status           = "operational"
    }

  # statuspage_component.dash[1] will be created
  + resource "statuspage_component" "dash" {
      + automation_email = (known after apply)
      + id               = (known after apply)
      + name             = "Spacemesh devnet 21 Dashboard"
      + page_id          = "twrbgq249mgx"
      + showcase         = true
      + status           = "operational"
    }

  # statuspage_component.explorer[1] will be created
  + resource "statuspage_component" "explorer" {
      + automation_email = (known after apply)
      + id               = (known after apply)
      + name             = "Spacemesh devnet 21 Explorer"
      + page_id          = "twrbgq249mgx"
      + showcase         = true
      + status           = "operational"
    }

Plan: 9 to add, 1 to change, 0 to destroy.

Changes to Outputs: ***